# Задание по "Динамической типизации"

# Создание переменной name и присваивание ей значения (строка)
name = "Александр"
# Вывод значения переменной name на экран
print("Name:", name)

# Создание переменной age и присваивание ей значения (целое число)
age = 26
# Вывод значения переменной age на экран
print("Age:", age)

# Здесь перезаписана переменная age с увеличенным её значением
age = age + 1
# Вывод изменённого значения переменной age на экран
print("New Age:", age)

# Создание переменной is_student и присваивание ей значения True (логическое значение)
is_student = True
# Вывод значения переменной is_student на экран
print("Is Student:", is_student)
